{
  "allowed_gates": [
    "AND"
  ],
  "help": "## Математическая логика\nМатематическая логика — это раздел математики, изучающий булевы функции. Булевы функции — это функции, которые на вход получают аргументы, каждый из которых является либо 0, либо 1, а на каждый из выходов выдают либо 0, либо 1.\n\nИнтерпретации этим нулям и единицам можно придумать разные.\nНапример: 0 — ложь, 1 — истина.\nИли: 0 — сигнал отсутствует, 1 — сигнал есть.\nИли: 0 — тока нет, 1 — ток идёт.\n\nВ этой обучающей головоломке Вам будет предложено реализовывать некоторые булевы функции, используя другие, базовые, булевы функции.\n\nДля большего понимания, что такое булева функция, можно привести пример из реальной жизни.\nФары автомобиля. Булева функция, которая отвечает за то, горят они или нет может выглядеть так:\nВыход выдает 0 или 1 — фары не горят или горят.\nВхода два, один говорит есть ли от аккумулятора исходящий ток или нет, а другой говорит, нажата ли соответствующая кнопка на приборной панели.\n\nДолжно быть очевидно, что такая функция выдает 1 только если есть ток от аккумулятора и нажата соответствующая кнопка на приборной панели.\n\nТаким образом, это является примером базового логического элемента \"логическое И\", о котором далее пойдет речь.\n\nМожно придумать множество других булевых функций с более сложной логикой работы\n\n## Логическое И\nЭто логический элемент, у которого два входа и один выход. Он выдает сигнал, только если сигнал был подан на оба входа. В противном случае (например, если сигналов не было подано впринципе или был подан только на один из входов), сигнал выдавать \"логическое И\" не будет.\n\nДругими словами, \nЕсли на вход подано 0,0 -- выход будет 0\nЕсли на вход подано 0,1 -- выход будет 0\nЕсли на вход подано 1,0 -- выход будет 0\nЕсли на вход подано 1,1 -- выход будет 1\n\nЭто информацию содержит в себе таблица истинности, которая приведена на нижней панели. Она показывает, какие значения должна выдавать функция для каждого возможного варианта входных данных. Красные точки означают 0, а зеленые -- 1. Читать это таблицу истинности следует сверху-вниз. Первые две точки -- входы, следующая точка -- выход, который должен быть при этих входах, а последняя строчка -- тот выход, который наблюдается в сконструированной вами функции.\n\nВам нужно сконструировать такую функцию, чтобы последние две строчки совпали.\n\nВ этом задании (как и во всех остальных заданиях из этого блока) требуется воспользоваться описанным выше логическим элементом. Если Вы считаете, что готовы приступить к настоящим задачам, то можете сразу переходить к следующему блоку.\n\nУдачи.",
  "input_names": [
    "A",
    "B"
  ],
  "n_inputs": 2,
  "n_outputs": 1,
  "name": "Обучение. Логическое \"И\"",
  "output_names": [
    "A ^ B"
  ],
  "priority": 15,
  "truth_table": [
    [
      false,
      false,
      false,
      true
    ]
  ],
  "tutorial": true
}